<a href="https://colab.research.google.com/github/sac-1999/Pandas-Cheat-Sheet/blob/main/02_Merging_two_dataframes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [29]:

import pandas as pd
import requests
import io
    
# Downloading the csv file from your GitHub account

url = "https://raw.githubusercontent.com/shanealynn/Pandas-Merge-Tutorial/master/user_usage.csv" 
download = requests.get(url).content

file = io.StringIO(download.decode('utf-8'))

df = pd.read_csv(file)

In [30]:
df.head()

   outgoing_mins_per_month  outgoing_sms_per_month  monthly_mb  use_id
0                    21.97                    4.82     1557.33   22787
1                  1710.08                  136.88     7267.55   22788
2                  1710.08                  136.88     7267.55   22789
3                    94.46                   35.17      519.12   22790
4                    71.59                   79.26     1557.33   22792

In [31]:

url = "https://raw.githubusercontent.com/shanealynn/Pandas-Merge-Tutorial/master/user_device.csv" 
download = requests.get(url).content

file = io.StringIO(download.decode('utf-8'))

df2 = pd.read_csv(file)

In [32]:
df2.head()

   use_id  user_id platform  platform_version     device  use_type_id
0   22782    26980      ios              10.2  iPhone7,2            2
1   22783    29628  android               6.0    Nexus 5            3
2   22784    28473  android               5.1   SM-G903F            1
3   22785    15200      ios              10.2  iPhone7,2            3
4   22786    28239  android               6.0  ONE E1003            1

In [33]:


url = "https://raw.githubusercontent.com/shanealynn/Pandas-Merge-Tutorial/master/android_devices.csv" 
download = requests.get(url).content

file = io.StringIO(download.decode('utf-8'))

df3 = pd.read_csv(file)

In [35]:
df3.head()

  Retail Branding Marketing Name    Device                      Model
0             NaN            NaN    AD681H  Smartfren Andromax AD681H
1             NaN            NaN     FJL21                      FJL21
2             NaN            NaN       T31              Panasonic T31
3             NaN            NaN  hws7721g         MediaPad 7 Youth 2
4              3Q        OC1020A   OC1020A                    OC1020A

In [39]:
print(list(df.columns))
print(list(df2.columns))
print(list(df3.columns))

['outgoing_mins_per_month', 'outgoing_sms_per_month', 'monthly_mb', 'use_id']
['use_id', 'user_id', 'platform', 'platform_version', 'device', 'use_type_id']
['Retail Branding', 'Marketing Name', 'Device', 'Model']

In [67]:
from IPython.core.magic import register_cell_magic
from IPython.display import HTML, display

@register_cell_magic
def bgc(color, cell=None):
    script = (
        "var cell = this.closest('.jp-CodeCell');"
        "var editor = cell.querySelector('.jp-Editor');"
        "editor.style.background='{}';"
        "this.parentNode.removeChild(this)"
    ).format(color)

    display(HTML('<img src onerror="{}">'.format(script)))

# $\color{blue}{\text{Merging}}$

In [68]:
bgc('yellow')
merge_1 = pd.merge(df,
                 df2[['use_id', 'platform', 'device']],
                 on='use_id', how = 'left', indicator=True)
merge_1.head()

   outgoing_mins_per_month  outgoing_sms_per_month  ...    device  _merge
0                    21.97                    4.82  ...  GT-I9505    both
1                  1710.08                  136.88  ...  SM-G930F    both
2                  1710.08                  136.88  ...  SM-G930F    both
3                    94.46                   35.17  ...     D2303    both
4                    71.59                   79.26  ...  SM-G361F    both

[5 rows x 7 columns]